In [13]:
import mysql.connector
from faker import Faker
import random
from tqdm import tqdm
from datetime import timedelta
import time
import pandas as pd
import urllib.parse
from sqlalchemy import create_engine

In [ ]:

# MySQL connection
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Mysql@1234",
    database="analysis"
)
cursor = conn.cursor()
fake = Faker()

In [14]:
host="localhost"
username="root"
password="Mysql@1234"
port = '3306'  
database="analysis"
encoded_password = urllib.parse.quote_plus(password)
engine = create_engine(f"mysql+mysqlconnector://{username}:{encoded_password}@{host}:{port}/{database}")

In [15]:
engine

Engine(mysql+mysqlconnector://root:***@localhost:3306/analysis)

In [4]:
# Insert departments
departments = [(i, f"Department_{i}") for i in range(1, 1001)]
cursor.executemany("INSERT INTO departments (department_id, department_name) VALUES (%s, %s)", departments)
conn.commit()

# Insert cities
cities = []
for i in range(1, 201):
    cities.append((i, f"City_{i}", fake.state(), random.randint(50000, 5000000)))
cursor.executemany("INSERT INTO cities (city_id, city_name, state, population) VALUES (%s, %s, %s, %s)", cities)
conn.commit()

# Insert employees (100k records)
batch_size = 5000
total_records = 100000

for batch_start in tqdm(range(0, total_records, batch_size)):
    records = []
    for i in range(batch_start + 1, batch_start + batch_size + 1):
        name = fake.name()
        department_id = random.randint(1, 1000)
        salary = round(random.uniform(30000, 200000), 2)
        join_date = fake.date_between(start_date='-10y', end_date='today')
        city_id = random.randint(1, 200)
        bonus = round(random.uniform(500, 10000), 2)
        records.append((i, name, department_id, salary, join_date, city_id, bonus))
    cursor.executemany("""
        INSERT INTO employees (employee_id, name, department_id, salary, join_date, city_id, bonus)
        VALUES (%s, %s, %s, %s, %s, %s, %s)
    """, records)
    conn.commit()

# Insert employee performance (2000 records)
performances = []
for i in range(1, 2001):
    employee_id = random.randint(1, 100000)
    review_year = random.randint(2018, 2023)
    rating = random.randint(1, 5)
    remarks = fake.sentence()
    performances.append((i, employee_id, review_year, rating, remarks))
cursor.executemany("""
    INSERT INTO employee_performance (performance_id, employee_id, review_year, rating, remarks)
    VALUES (%s, %s, %s, %s, %s)
""", performances)
conn.commit()

cursor.close()
conn.close()
print("Data generation complete!")

100%|██████████| 20/20 [00:07<00:00,  2.68it/s]

Data generation complete!

In [16]:
df_employees = pd.read_sql('SELECT * FROM employees', con=engine)

In [18]:
df_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   employee_id    100000 non-null  int64
 1   name           100000 non-null  object
 2   department_id  100000 non-null  int64
 3   salary         100000 non-null  float64
 4   join_date      100000 non-null  object
 5   city_id        100000 non-null  int64
 6   bonus          100000 non-null  float64
dtypes: float64(2), int64(3), object(2)
memory usage: 5.3+ MB

In [19]:
df_employees.head()

,employee_id,name,department_id,salary,join_date,city_id,bonus
0,1,Holly Morris,487,116342.0,2015-06-14,91,8955.18
1,2,Sandra Holloway,555,189000.0,2015-05-11,103,556.90
2,3,Patricia Jennings,252,121739.0,2021-09-11,171,8331.85
3,4,Eric Thomas DVM,287,143908.0,2016-12-18,18,4615.09
4,5,Melissa Kim,497,63221.8,2023-02-02,66,3349.39

In [23]:
df_employees['join_date'][0].year

2015